/* errSecAllocate */
"KEYCHAIN_ERR_SEC_ALLOCATE" = "No se pudo asignar memoria.";

/* errSecAuthFailed */
"KEYCHAIN_ERR_SEC_AUTH_FAILED" = "El nombre de usuario o la frase de contraseña que has introducido no es correcto.";

/* errSecDecode */
"KEYCHAIN_ERR_SEC_DECODE" = "Incapaz de decodificar los datos proporcionados.";

/* default keychain error */
"KEYCHAIN_ERR_SEC_DEFAULT" = "Consulte <Security/SecBase.h> para la descripción.";

/* errSecDuplicateItem */
"KEYCHAIN_ERR_SEC_DUPLICATE_ITEM" = "El elemento especificado ya existe en el llavero.";

/* errSecInteractionNotAllowed */
"KEYCHAIN_ERR_SEC_ITEM_NOT_ALLOWED" = "No se permite la interacción del usuario.";

/* errSecItemNotFound */
"KEYCHAIN_ERR_SEC_ITEM_NOT_FOUND" = "El elemento especificado no se pudo encontrar en el llavero.";

/* errSecNotAvailable */
"KEYCHAIN_ERR_SEC_NOT_AVAILABLE" = "Sin llavero está disponible. Es posible que tenga que reiniciar el equipo.";

/* errSecParam */
"KEYCHAIN_ERR_SEC_PARAM" = "Uno o más parámetros pasados a una función que no es válido.";

/* errSecUnimplemented */
"KEYCHAIN_ERR_SEC_UNIMPLEMENTED" = "Función o la operación no se han aplicado.";

